app/views/gossip/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
          <h5 class="card-title">Titre : <%= gossip.title %></h5>
          <p class="card-text">Auteur : <%= gossip.user.first_name%></p>