app/controllers/gossip_controller.rb

SELECT "gossips".* FROM "gossips"
---
  def index
    @gossips = Gossip.all # permet de pouvoir utiliser '@gossips' dans la view "gossip#index" et donc d'y lister tous les gossips.
  end

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def show
    @gossip = Gossip.find(params[:id]) # permet de choisir le gossip à afficher selon l'id du param et d'afficher la page de ce gossip en particulier

SELECT "users".* FROM "users"
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "azerty"], ["content", "qwerty is dead"], ["user_id", 2], ["created_at", "2022-05-12 15:10:58.385263"], ["updated_at", "2022-05-12 15:10:58.385263"]]
---
  def create # ici 'params' sert à récupérer les inputs de l'utilisateur dans le formulaire de la page 'gossip/new' et créé une entre en BDD avec ces données.
    @gossip = Gossip.new(
      'title' => params[:title],
      'content' => params[:content],
      'user_id' => User.all.sample.id # à remplacer par 'current_user.id'(pour l'instant on prend un id au hasard parmis nos Users, mais il faudra changer cela ! )
    )

    if @gossip.save # on tente de voir si la création a bien fonctionné :