app/controllers/user_controller.rb

  def create
    @user = User.new(
      'first_name' => params[:first_name],
      'last_name' => params[:last_name],

      'password' => params[:password],

      'email' => params[:email],
      'city_id' => City.all.sample.id # (pour l'instant on prend un id au hasard parmis nos Cities)
    )

    if @user.save # on tente de voir si la création a bien fonctionné :
---
SELECT "cities".* FROM "cities"
INSERT INTO "users" ("first_name", "last_name", "email", "city_id", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"